app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "songs" SET "title" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Mr. Brightsideways"], ["updated_at", "2017-05-17 04:29:00.538401"], ["id", 1]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)